{
  "notFound": {
    "text": "Page not found"
  },
  "error": "Something went wrong, but we are working to fix the problem",
  "auth": {
    "main": "Main Page",
    "welcome": "Welcome",
    "login": "Login",
    "signUp": "Sign Up",
    "logOut": "Logout",
    "email": "Email",
    "password": "Password",
    "loginPage": {
      "header": "Login in account",
      "subheader": "Do not have an account? "
    },
    "signUpPage": {
      "header": "Create an account",
      "subheader": "Already have an account? "
    }
  },
  "formErrorMessage": {
    "loginError": "Invalid username or password!",
    "otherError": "Something went wrong...",
    "tooManyRequests": "Too many requests",
    "emailError": "The username is occupied by another user!",
    "emailInvalid": "Email is invalid",
    "oneNumberError": "Must contain number!",
    "oneUpperLetterError": "Must contain one uppercase letter!",
    "oneLowerLetterError": "Must contain one lower letter!",
    "oneSpecialCharacterError": "Must contain one character ~!@#$%^&*()_+\"№;:?*",
    "minLength": "Minimum 8 characters!",
    "required": "Required field!",
    "notMatch": "Passwords not match!"
  },
  "mainPage": {
    "changeApi": "Change API",
    "changeApiBtn": "Change",
    "variableName": "Variables",
    "headersName": "Headers",
    "doc": "Documentation",
    "loading": "Loading...",
    "validHeaderMessage": "Please enter valid JSON format for headers",
    "validVariableMessage": "Please enter valid JSON format for variables",
    "validUrlMessage": "Please enter valid Url",
    "currentUrl": "Current URL:",
    "successChangeUrlMessage": "The api was successfully changed",
    "errorCorsMessage": "Please enter the correct api address or api that supports cors"
  },
  "welcome": {
    "rsSchool": "RS School is free-of-charge and community-based education program conducted by The Rolling Scopes developer community since 2013. Everyone can study at RS School, regardless of age, professional employment, or place of residence. The mentors and trainers of our school are front-end and javascript developers from different companies and countries.",
    "aboutProject": "About Project",
    "projectDescription": "The Mission Impossible team is glad to see you! We will make a project of any complexity according to the requirements of the terms of reference, within the agreed time frame. We will provide technical support for the project and further product development. Individual approach to each client. If you have any questions, you can contact any of us. GraphiQL is a playground/IDE for graphQL requests. You can use any API that supports CORS to work. We hope you will be satisfied with the quality of our application. Please send all suggestions for improving the operation of the application to the developers.",
    "developer": "Developer Team",
    "positionTeamLead": "Team Lead",
    "position": "Frontend Developer",
    "info": {
      "andrei": {
        "name": "Andrei",
        "description": "Head of the development team. Andrey has extensive management experience from his previous job - bridge construction and design. Andrey had up to 50 people under his command, so leading a small development team is not a problem for him. He clearly sets tasks for each member of his team and demands an appropriate result. I am always ready to help and additionally explain the task. He has two years of experience in application development. Andrey is a FullStack developer, able to write both the backend and frontend parts of the application."
      },
      "oksana": {
        "name": "Oksana",
        "description": "Frontend developer. Oksana has one year of professional development. Economics education and financial experience help Oksana solve algorithmic problems of any complexity. I was lucky enough to work with Oksana on several joint projects, so I can safely say that she is able to figure out and solve any task. She chose frontend because she likes the variety it provides. It has a balance between creating beautiful and interactive websites, as well as writing complex logic. I like to do layout and create great sites using different styles, although often the design of sites is reduced to a theme with touching cats =). In the future, he wants to develop in the backend direction and become a FullStack developer."
      },
      "max": {
        "name": "Maxim",
        "description": "Frontend developer. Maxim has a professional technical education, a master's degree in Computer Science and Computer Engineering. He started developing at the university. He found himself in the frontend direction and has been creating modern and responsive web applications for a year now. Maxim enjoys what he does and believes that this is the most important thing - you should like your job, because only then can you succeed. He likes that in frontend development you can immediately feel and see the result of the work done."
      }
    }
  }
}
