{
  "notFound": {
    "text": "Страница не найдена",
    "failedLoad": "Не удалось загрузить страницу"
  },
  "error": "Что то пошло не так, но мы работаем над решением данной проблемы",
  "auth": {
    "main": "Главная страница",
    "welcome": "Добро пожаловать",
    "login": "Войти",
    "signUp": "Зарегистрироваться",
    "logOut": "Выйти",
    "email": "Почта",
    "password": "Пароль",
    "loginPage": {
      "header": "Войдите в аккаунт",
      "subheader": "Нет аккаунта? "
    },
    "signUpPage": {
      "header": "Создайте аккаунт",
      "subheader": "Уже есть аккаунт? "
    }
  },
  "formErrorMessage": {
    "loginError": "Неверный логин или пароль",
    "otherError": "Что-то пошло не так...",
    "tooManyRequests": "Слишком много запросов",
    "emailError": "Логин занят другим пользователем",
    "emailInvalid": "Недопустимый формат",
    "oneNumberError": "Требуется число!",
    "oneUpperLetterError": "Требуется заглавная буква!",
    "oneLowerLetterError": "Требуется строчная буква!",
    "oneSpecialCharacterError": "Требуется спецсимвол ~!@#$%^&*()_+\"№;:?*",
    "minLength": "Минимум 8 символов!",
    "required": "Обязательное поле!",
    "notMatch": "Пароли не совпадают!"
  },
  "mainPage": {
    "changeApi": "Сменить API",
    "changeApiBtn": "Сменить",
    "variableName": "Переменные",
    "headersName": "Заголовки",
    "show": "Показать",
    "hide": "Скрыть",
    "doc": "Документация",
    "loading": "Загрузка...",
    "validHeaderMessage": "Пожалуйста, введите корректный JSON формат для заголовков",
    "validVariableMessage": "Пожалуйста, введите корректный JSON формат для переменных",
    "validUrlMessage": "Пожалуйста, введите корректный Url",
    "currentUrl": "Текущий адрес:",
    "successChangeUrlMessage": "Api был успешно изменен",
    "errorCorsMessage": "Пожалуйста⸴ введите корректный адрес API или API⸴ которая поддерживает CORS",
    "emptyDocMessage": "Нет документации"
  },
  "welcome": {
    "rsSchool": "RS School - бесплатная образовательная программа на базе сообщества, проводимая сообществом разработчиков Rolling Scopes с 2013 года. Учиться в RS School может каждый, независимо от возраста, профессиональной занятости или места жительства. Наставниками и тренерами нашей школы являются разработчики front-end и javascript из разных компаний и стран.",
    "aboutProject": "О проектe",
    "projectDescription": "Команда Миссия Невыполнима рада видеть вас! Мы сделаем проект любой сложности по требованиям технического задания, в согласованные сроки. Обеспечим техническую поддержку проекта и дальнейшее развитие продукта. Индивидуальный подход к каждому клиенту. Если возникли вопросы, Вы можете обратиться к любому из нас.Graphics игровая площадка для  graphQL запросов. Для работы вы можете использовать любую API поддерживающую CORS. Надеемся Вы останетесь довольны качеством нашего приложения. Все предложения по улучшению работы приложения просим направлять разработчикам.",
    "developer": "Команда разработчиков",
    "info": [
      {
        "name": "Андрей",
        "position": "Руководитель проекта",
        "description": "Руководитель команды разработки. Андрей обладает большим опытом руководства с прошлого места работы - строительство и проектирование мостов. В подчинении у Андрея было до 50 человек, поэтому руководить небольшой командой разработчиков для него не составлят проблем. Он четко ставит задачи для каждого члена свой команды и требует соответсвуещего результат. Всегда готов помочь и дополнительно объяснить поставленную задачу. Обладает двух летним опытом в разработки приложений. Андрей является FullStack разработчиком, способен написать, как backend, так и frontend часть приложения."
      },
      {
        "name": "Оксана",
        "position": "Фронтетд разработчик",
        "description": "Фронтенд разработчик. Оксана имеет один год профессиональной разработки. Экономическое образование и опыт работы с финансами, помогают Оксане решать алгоритмические задачи любой сложности. Мне посчастиливось поработать с Оксаной на нескольких совместных проектах, поэтому смело могу сказать, что она способна разобраться и решить любую поставленную задачу. Она выбрала frontend, потому что ей нравится разнообразие, которое он предоставляет. В нем есть баланс между созданием красивых и интерактивных сайтов, а также написание сложной логики. Нравится заниматься версткой и создавать прекрасные сайты с использованием различных стилей, правда частенько дизайн сайтов сводится к теме с умилительными котикам =). В дальнейшем хочет развиваться в backend направление и стать FullStack разработчиком."
      },
      {
        "name": "Максим",
        "position": "Фронтетд разработчик",
        "description": "Фронтенд разработчик. Максим имеет профессиональное техническое образование, степень магистра по специальности: Информатика и вычислительная техника. Начал заниматься разаботкой еще в университете. Нашел себя во frontend направлении и уже год создает современные и отзывчивые веб-приложения. Максим получает удовольтвие от того, чем занимается и считает, что это самое главное - работа должна нравится, ведь только тогда можно добиться успеха. Ему нравится, что во frontend разработке можно сразу пощупать и увидеть резульат проделанной работы."
      }
    ]
  }
}
